// Ctrl + / - Перейти к строке под номером ———————————---------------
// ❗️Alt + ↑ / ↓ - Поменять строку местами с соседними         
// —————————————-------------
// Дублировать строку 
// ❗️Shift + Alt + ↓ / ↑
// ___________________________
// ❗️F2  - Переименовать переменную                                             
// ________________________
// Alt + Z Включить/выключить перенос слов 
// —————————————--------------
// ❗️Ctrl + >Ю -Авто импорт
// -----------------------
// ❗️ Alt + клик мыши 
// -----------------------
// ❗️Ctrl + F2 - Преименовать 
// все переменые 
// -------------------------
// или увеличить шрифт
// ❗️CTRL + SHFT + P 
// Shift + Alt + Fформатирование

// shift  alt + O выровнять импорты
// Ctrl + ← → - перескочить через слово
// ❗️Ctrl + Shift + ← → - Выделение целых слов
// Ctrl + G - Перейти к строке под номером


//  ALT + SHIFT + T для перевода слова на другой язхык  Extensions-(Vscode Google Translate)
// Ctrl + Shift + \ - Перейти к парной скобке|

// Ctrl + B - закрыть боковую панель 
// Ctrl + D - Выделить все переменые с таким названием 
// Ctrl + H - Вызвать панель ищменения переменных
// ❗️Ctrl + backspace -Удаление предыдущего слова
// ❗️Ctrl + >Ю -Авто импорт
// ❗️Ctrl + - или + уменшить 
// ❗️Ctrl + Alt + стрелка вверх / вниз
// Ctrl+ F  поиск VS Code
// Ctrl + A Выделить все
// Ctrl + Z Отменить
// Ctrl + Y Вернуть
// Ctrl + x - копирование и удаление строки
// Ctrl + Alt + стрелка вверх / вниз - Добавление курсора сверху / снизу

//❗️Ctrl + K  + S❗️- Показать список горячих клавиш















